ruby-on-rails/quiz/app/controllers/questions_controller.rb

INSERT INTO "questions" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "¿Cual es tu color favorito?"], ["created_at", "2018-05-24 06:38:39.136456"], ["updated_at", "2018-05-24 06:38:39.136456"]]
---
  def create
    @question = Question.new(params_question)
    respond_to do |format|
      if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "questions" SET "text" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["text", "¿Cual es tu artista favorito?"], ["updated_at", "2018-05-24 06:42:40.514653"], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])
    respond_to do |format|
      if @question.update_attributes(params_question)