ruby-on-rails/quiz/app/controllers/quiz_controller.rb

SELECT "questions".* FROM "questions"
---
  def start
    total = params[:number].to_i
    all = Question.all.map {|x| x.id}

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def question
    @current = session[:current]
    @total = session[:total]
    if @current >= @total
      redirect_to :action => 'end'
      return
    end
    @question = Question.find(session[:questions][@current])

SELECT  "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def answer
    @current = session[:current]
    @total = session[:total]
    choiceid = params[:choice]
    @question = session[:question]
    @choices = session[:choices]
    @choice = choiceid ? Choice.find(choiceid):nil