ruby-on-rails/sales/lib/rails_admin/rails_admin_pdf.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "product_quantities".* FROM "product_quantities" WHERE "product_quantities"."sale_id" = ?  [["sale_id", 1]]
---
                sales_values = {}
                @object.sales.each do |sale|
                  calc = 0
                  sale.product_quantities.each {|p| calc += p.product.price * p.quantity}