ruby-on-rails/pinterest/app/controllers/pins_controller.rb

  def pinsof
    @user_id = params[:user_id]
    @user = User.find(@user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @pin = Pin.new(pin_params)
    @pin.user_id = current_user.id

    respond_to do |format|
      if @pin.save
---
INSERT INTO "pins" ("photo", "description", "created_at", "updated_at", "name", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @pin.update(pin_params)
---
UPDATE "pins" SET "description" = ?, "updated_at" = ? WHERE "pins"."id" = ?  [["description", "Planeta 1"], ["updated_at", "2018-05-27 06:34:07.115477"], ["id", 1]]