ruby-on-rails/sales/app/models/sale.rb

SELECT  "discounts".* FROM "discounts" WHERE "discounts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---

    if self.discount
      if self.discount.kind == "porcent"
        calc -= calc / self.discount.value

SELECT  "comissions".* FROM "comissions" WHERE "comissions"."sale_id" = ? LIMIT ?  [["sale_id", 1], ["LIMIT", 1]]
INSERT INTO "comissions" ("sale_id", "value", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["sale_id", 1], ["value", 7.0], ["user_id", 1], ["status", 0], ["created_at", "2018-06-03 03:57:12.423292"], ["updated_at", "2018-06-03 03:57:12.423292"]]
---
      end
    end

    if self.comission.present?
      self.comission.update(value: (calc * 0.1), status: :pending)
    else
      Comission.create(value: (calc * 0.1), user: self.user, sale: self, status: :pending)