ruby-on-rails/quiz/app/views/questions/show.html.erb

SELECT  "choices".* FROM "choices" WHERE "choices"."question_id" = ? ORDER BY "choices"."id" ASC LIMIT ?  [["question_id", 1], ["LIMIT", 1000]]
---
<ul>
  <% @question.choices.find_each do |choice| %>